hiperiondev/esp32-microvium/components/esp32-ftp-server/esp32_ftp_server.c
/*
 * This file is part of the MicroPython ESP32 project, https://github.com/loboris/MicroPython_ESP32_psRAM_LoBo
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2018 LoBo (https://github.com/loboris)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
/*
 * This file is based on 'ftp' from Pycom Limited.
 *
 * Author: LoBo, loboris@gmail.com
 * Copyright (c) 2017, LoBo
 */

#include <stdio.h>
#include <inttypes.h>
#include <stdint.h>
#include <string.h>
#include <ctype.h>
#include <stdio.h>
#include <errno.h>
#include <fcntl.h>
#include <unistd.h>
#include <sys/stat.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "dirent.h"
#include "esp_system.h"
#include "esp_log.h"
#include "esp_wifi.h"
#include "lwip/sockets.h"
#include "esp32_ftp_server.h"

const char *FTP_TAG = "ftpserver";

#define FTP_MOUNT_POINT     "/littlefs"
#define CONFIG_FTP_USER     "test"
#define CONFIG_FTP_PASSWORD "test"

#define FTPSERVER_USER_PASS_LEN_MAX        32
#define FTPSERVER_CMD_TIMEOUT_MS           (FTPSERVER_TIMEOUT*1000)
#define FTPSERVER_BUFFER_SIZE              1024
#define FTPSERVER_TIMEOUT                  300
#define FTPSERVER_ALLOC_PATH_MAX           (512)
#define FTPSEREVR_MAX_ACTIVE_INTERFACES    3

#define FTPSERVER_CMD_PORT                 21
#define FTPSERVER_ACTIVE_DATA_PORT         20
#define FTPSERVER_PASIVE_DATA_PORT         2024
#define FTPSERVER_CMD_SIZE_MAX             6
#define FTPSERVER_CMD_CLIENTS_MAX          1
#define FTPSERVER_DATA_CLIENTS_MAX         1
#define FTPSERVER_MAX_PARAM_SIZE           (FTPSERVER_ALLOC_PATH_MAX + 1)
#define FTPSERVER_UNIX_SECONDS_180_DAYS    15552000
#define FTPSERVER_DATA_TIMEOUT_MS          10000   // 10 seconds
#define FTPSERVER_SOCKETFIFO_ELEMENTS_MAX  4

#ifndef MAX
    #define MAX(x, y) ((x) > (y) ? (x) : (y))
#endif

static int ftp_buff_size = FTPSERVER_BUFFER_SIZE;
static int ftp_timeout = FTPSERVER_CMD_TIMEOUT_MS;

static uint8_t ftp_stop = 0;
static char ftp_user[FTPSERVER_USER_PASS_LEN_MAX + 1];
static char ftp_pass[FTPSERVER_USER_PASS_LEN_MAX + 1];
static esp_netif_t *net_if[FTPSEREVR_MAX_ACTIVE_INTERFACES];

static ftp_data_t ftp_data = { 0 };
static char *ftp_path = NULL;
static char *ftp_scratch_buffer = NULL;
static char *ftp_cmd_buffer = NULL;
static uint8_t ftp_nlist = 0;
static const ftp_cmd_t ftp_cmd_table[] = {
        { "FEAT" }, { "SYST" }, { "CDUP" }, { "CWD"  }, { "PWD"  },
        { "XPWD" }, { "SIZE" }, { "MDTM" }, { "TYPE" }, { "USER" },
        { "PASS" }, { "PASV" }, { "LIST" }, { "RETR" }, { "STOR" },
        { "DELE" }, { "RMD"  }, { "MKD"  }, { "RNFR" }, { "RNTO" },
        { "NOOP" }, { "QUIT" }, { "APPE" }, { "NLST" }, { "AUTH" }
};

uint64_t mp_hal_ticks_ms(void) {
    uint64_t time_ms = xTaskGetTickCount() * portTICK_PERIOD_MS;
    return time_ms;
}

int network_get_active_interfaces(void) {
    ESP_LOGI(FTP_TAG, "network_get_active_interfaces");
    int n_if = 0;

    wifi_mode_t mode;
    esp_err_t ret = esp_wifi_get_mode(&mode);
    if (ret == ESP_OK) {
        if (mode == WIFI_MODE_STA) {
            n_if = 1;
            net_if[0] = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
        } else if (mode == WIFI_MODE_AP) {
            n_if = 1;
            net_if[0] = esp_netif_get_handle_from_ifkey("WIFI_APDEF");
        } else if (mode == WIFI_MODE_APSTA) {
            n_if = 2;
            net_if[0] = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
            net_if[1] = esp_netif_get_handle_from_ifkey("WIFI_APDEF");
        }
    }

    return n_if;
}

static void stoupper(char *str) {
    while (str && *str != '\0') {
        *str = (char) toupper((int ) (*str));
        str++;
    }
}

static bool ftp_open_file(const char *path, const char *mode) {
    ESP_LOGI(FTP_TAG, "ftp_open_file: path=[%s]", path);
    char fullname[128];
    strcpy(fullname, FTP_MOUNT_POINT);
    strcat(fullname, path);
    ESP_LOGI(FTP_TAG, "ftp_open_file: fullname=[%s]", fullname);
    ftp_data.fp = fopen(fullname, mode);
    if (ftp_data.fp == NULL) {
        ESP_LOGE(FTP_TAG, "ftp_open_file: open fail [%s]", fullname);
        return false;
    }
    ftp_data.e_open = E_FTP_FILE_OPEN;
    return true;
}

static void ftp_close_files_dir(void) {
    if (ftp_data.e_open == E_FTP_FILE_OPEN) {
        fclose(ftp_data.fp);
        ftp_data.fp = NULL;
    } else if (ftp_data.e_open == E_FTP_DIR_OPEN) {
        closedir(ftp_data.dp);
        ftp_data.dp = NULL;
    }
    ftp_data.e_open = E_FTP_NOTHING_OPEN;
}

static void ftp_close_filesystem_on_error(void) {
    ftp_close_files_dir();
    if (ftp_data.fp) {
        fclose(ftp_data.fp);
        ftp_data.fp = NULL;
    }
    if (ftp_data.dp) {
        closedir(ftp_data.dp);
        ftp_data.dp = NULL;
    }
}

static ftp_result_t ftp_read_file(char *filebuf, uint32_t desiredsize, uint32_t *actualsize) {
    ftp_result_t result = E_FTP_RESULT_CONTINUE;
    *actualsize = fread(filebuf, 1, desiredsize, ftp_data.fp);
    if (*actualsize == 0) {
        ftp_close_files_dir();
        result = E_FTP_RESULT_FAILED;
    } else if (*actualsize < desiredsize) {
        ftp_close_files_dir();
        result = E_FTP_RESULT_OK;
    }
    return result;
}

