hiperiondev/esp32-microvium/components/esp32-ftp-server/esp32_ftp_server.c
static ftp_result_t ftp_write_file(char *filebuf, uint32_t size) {
    ftp_result_t result = E_FTP_RESULT_FAILED;
    uint32_t actualsize = fwrite(filebuf, 1, size, ftp_data.fp);
    if (actualsize == size) {
        result = E_FTP_RESULT_OK;
    } else {
        ftp_close_files_dir();
    }
    return result;
}

static ftp_result_t ftp_open_dir_for_listing(const char *path) {
    if (ftp_data.dp) {
        closedir(ftp_data.dp);
        ftp_data.dp = NULL;
    }
    ESP_LOGI(FTP_TAG, "ftp_open_dir_for_listing path=[%s] MOUNT_POINT=[%s]", path, FTP_MOUNT_POINT);
    char fullname[128];
    strcpy(fullname, FTP_MOUNT_POINT);
    strcat(fullname, path);
    ESP_LOGI(FTP_TAG, "ftp_open_dir_for_listing: %s", fullname);
    ftp_data.dp = opendir(fullname);  // Open the directory
    if (ftp_data.dp == NULL) {
        return E_FTP_RESULT_FAILED;
    }
    ftp_data.e_open = E_FTP_DIR_OPEN;
    ftp_data.listroot = false;
    return E_FTP_RESULT_CONTINUE;
}

static int ftp_get_eplf_item(char *dest, uint32_t destsize, struct dirent *de) {
    char *type = (de->d_type & DT_DIR) ? "d" : "-";

    // Get full file path needed for stat function
    char fullname[128];
    strcpy(fullname, FTP_MOUNT_POINT);
    strcat(fullname, ftp_path);
    if (fullname[strlen(fullname) - 1] != '/')
        strcat(fullname, "/");
    strcat(fullname, de->d_name);

    struct stat buf;
    int res = stat(fullname, &buf);
    ESP_LOGI(FTP_TAG, "ftp_get_eplf_item res=%d buf.st_size=%ld", res, buf.st_size);
    if (res < 0) {
        buf.st_size = 0;
        buf.st_mtime = 946684800; // Jan 1, 2000
    }

    char str_time[64];
    struct tm *tm_info;
    time_t now;
    if (time(&now) < 0)
        now = 946684800; // get the current time from the RTC
    tm_info = localtime(&buf.st_mtime); // get broken-down file time

    // if file is older than 180 days show dat,month,year else show month, day and time
    if ((buf.st_mtime + FTPSERVER_UNIX_SECONDS_180_DAYS) < now)
        strftime(str_time, 127, "%b %d %Y", tm_info);
    else
        strftime(str_time, 63, "%b %d %H:%M", tm_info);

    int addsize = destsize + 64;

    while (addsize >= destsize) {
        if (ftp_nlist)
            addsize = snprintf(dest, destsize, "%s\r\n", de->d_name);
        else
            addsize = snprintf(dest, destsize, "%srw-rw-rw-   1 root  root %9"PRIu32" %s %s\r\n", type, (uint32_t) buf.st_size, str_time, de->d_name);
        if (addsize >= destsize) {
            ESP_LOGW(FTP_TAG, "Buffer too small, reallocating [%d > %"PRIi32"]", ftp_buff_size, ftp_buff_size + (addsize - destsize) + 64);
            char *new_dest = realloc(dest, ftp_buff_size + (addsize - destsize) + 65);
            if (new_dest) {
                ftp_buff_size += (addsize - destsize) + 64;
                destsize += (addsize - destsize) + 64;
                dest = new_dest;
                addsize = destsize + 64;
            } else {
                ESP_LOGE(FTP_TAG, "Buffer reallocation ERROR");
                addsize = 0;
            }
        }
    }
    return addsize;
}

static ftp_result_t ftp_list_dir(char *list, uint32_t maxlistsize, uint32_t *listsize) {
    uint next = 0;
    uint listcount = 0;
    ftp_result_t result = E_FTP_RESULT_CONTINUE;
    struct dirent *de;

    // read up to 8 directory items
    while (((maxlistsize - next) > 64) && (listcount < 8)) {
        de = readdir(ftp_data.dp); // Read a directory item
        if (de == NULL) {
            result = E_FTP_RESULT_OK;
            break; // Break on error or end of dp
        }
        if (de->d_name[0] == '.' && de->d_name[1] == 0)
            continue; // Ignore . entry
        if (de->d_name[0] == '.' && de->d_name[1] == '.' && de->d_name[2] == 0)
            continue; // Ignore .. entry

        // add the entry to the list
        ESP_LOGI(FTP_TAG, "Add to dir list: %s", de->d_name);
        next += ftp_get_eplf_item((list + next), (maxlistsize - next), de);
        listcount++;
    }
    if (result == E_FTP_RESULT_OK) {
        ftp_close_files_dir();
    }
    *listsize = next;
    return result;
}

static void ftp_close_cmd_data(void) {
    closesocket(ftp_data.c_sd);
    closesocket(ftp_data.d_sd);
    ftp_data.c_sd = -1;
    ftp_data.d_sd = -1;
    ftp_close_filesystem_on_error();
}

static void _ftp_reset(void) {
    // close all connections and start all over again
    ESP_LOGW(FTP_TAG, "FTP RESET");
    closesocket(ftp_data.lc_sd);
    closesocket(ftp_data.ld_sd);
    ftp_data.lc_sd = -1;
    ftp_data.ld_sd = -1;
    ftp_close_cmd_data();

    ftp_data.e_open = E_FTP_NOTHING_OPEN;
    ftp_data.state = E_FTP_STE_START;
    ftp_data.substate = E_FTP_STE_SUB_DISCONNECTED;
}

static bool ftp_create_listening_socket(int32_t *sd, uint32_t port, uint8_t backlog) {
    struct sockaddr_in sServerAddress;
    int32_t _sd;
    int32_t result;

    // open a socket for ftp data listen
    *sd = socket(AF_INET, SOCK_STREAM, IPPROTO_IP);
    _sd = *sd;

    if (_sd > 0) {
        // enable non-blocking mode
        uint32_t option = fcntl(_sd, F_GETFL, 0);
        option |= O_NONBLOCK;
        fcntl(_sd, F_SETFL, option);

        // enable address reusing
        option = 1;
        result = setsockopt(_sd, SOL_SOCKET, SO_REUSEADDR, &option, sizeof(option));

        // bind the socket to a port number
        sServerAddress.sin_family = AF_INET;
        sServerAddress.sin_addr.s_addr = INADDR_ANY;
        sServerAddress.sin_len = sizeof(sServerAddress);
        sServerAddress.sin_port = htons(port);

        result |= bind(_sd, (const struct sockaddr*) &sServerAddress, sizeof(sServerAddress));

        // start listening
        result |= listen(_sd, backlog);

        if (!result) {
            return true;
        }
        closesocket(*sd);
    }
    return false;
}

static ftp_result_t ftp_wait_for_connection(int32_t l_sd, int32_t *n_sd, uint32_t *ip_addr) {
    struct sockaddr_in sClientAddress;
    socklen_t in_addrSize;

    // accepts a connection from a TCP client, if there is any, otherwise returns EAGAIN
    *n_sd = accept(l_sd, (struct sockaddr*) &sClientAddress, (socklen_t*) &in_addrSize);
    int32_t _sd = *n_sd;
    if (_sd < 0) {
        if (errno == EAGAIN) {
            return E_FTP_RESULT_CONTINUE;
        }
        // error
        _ftp_reset();
        return E_FTP_RESULT_FAILED;
    }

