hiperiondev/esp32-microvium/components/esp32-ftp-server/esp32_ftp_server.c
    if (ip_addr) {
        // check on which network interface the client was connected and save the IP address
        esp_netif_ip_info_t ip_info;
        int n_if = network_get_active_interfaces();

        if (n_if > 0) {
            struct sockaddr_in clientAddr;
            in_addrSize = sizeof(struct sockaddr_in);
            getpeername(_sd, (struct sockaddr*) &clientAddr, (socklen_t*) &in_addrSize);
            ESP_LOGI(FTP_TAG, "Client IP: 0x%08"PRIx32, clientAddr.sin_addr.s_addr);
            *ip_addr = 0;
            for (int i = 0; i < n_if; i++) {
                esp_netif_get_ip_info(net_if[i], &ip_info);
                ESP_LOGI(FTP_TAG, "Adapter: 0x%08"PRIx32", 0x%08"PRIx32, ip_info.ip.addr, ip_info.netmask.addr);
                if ((ip_info.ip.addr & ip_info.netmask.addr) == (ip_info.netmask.addr & clientAddr.sin_addr.s_addr)) {
                    *ip_addr = ip_info.ip.addr;
                    char name[8];
                    esp_netif_get_netif_impl_name(net_if[i], name);
                    ESP_LOGI(FTP_TAG, "Client connected on interface %s", name);
                    break;
                }
            }
            if (*ip_addr == 0) {
                ESP_LOGE(FTP_TAG, "No IP address detected (?!)");
            }
        } else {
            ESP_LOGE(FTP_TAG, "No active interface (?!)");
        }
    }

    // enable non-blocking mode if not data channel connection
    uint32_t option = fcntl(_sd, F_GETFL, 0);
    if (l_sd != ftp_data.ld_sd)
        option |= O_NONBLOCK;
    fcntl(_sd, F_SETFL, option);

    // client connected, so go on
    return E_FTP_RESULT_OK;
}

static void ftp_send_reply(uint32_t status, char *message) {
    if (!message) {
        message = "";
    }
    snprintf((char*) ftp_cmd_buffer, 4, "%"PRIu32, status);
    strcat((char*) ftp_cmd_buffer, " ");
    strcat((char*) ftp_cmd_buffer, message);
    strcat((char*) ftp_cmd_buffer, "\r\n");

    int32_t timeout = 200;
    ftp_result_t result;
    size_t size = strlen((char*) ftp_cmd_buffer);

    ESP_LOGI(FTP_TAG, "Send reply: [%.*s]", size - 2, ftp_cmd_buffer);
    vTaskDelay(1);

    while (1) {
        result = send(ftp_data.c_sd, ftp_cmd_buffer, size, 0);
        if (result == size) {
            if (status == 221) {
                closesocket(ftp_data.d_sd);
                ftp_data.d_sd = -1;
                closesocket(ftp_data.ld_sd);
                ftp_data.ld_sd = -1;
                closesocket(ftp_data.c_sd);
                ftp_data.substate = E_FTP_STE_SUB_DISCONNECTED;
                ftp_close_filesystem_on_error();
            } else if (status == 426 || status == 451 || status == 550) {
                closesocket(ftp_data.d_sd);
                ftp_data.d_sd = -1;
                ftp_close_filesystem_on_error();
            }
            vTaskDelay(1);
            ESP_LOGI(FTP_TAG, "Send reply: OK (%u)", size);
            break;
        } else {
            vTaskDelay(1);
            if ((timeout <= 0) || (errno != EAGAIN)) {
                // error
                _ftp_reset();
                ESP_LOGW(FTP_TAG, "Error sending command reply.");
                break;
            }
        }
        timeout -= portTICK_PERIOD_MS;
    }
}

static void ftp_send_list(uint32_t datasize) {
    int32_t timeout = 200;
    ftp_result_t result;

    ESP_LOGI(FTP_TAG, "Send list data: (%"PRIu32")", datasize);
    vTaskDelay(1);

    while (1) {
        result = send(ftp_data.d_sd, ftp_data.dBuffer, datasize, 0);
        if (result == datasize) {
            vTaskDelay(1);
            ESP_LOGI(FTP_TAG, "Send OK");
            break;
        } else {
            vTaskDelay(1);
            if ((timeout <= 0) || (errno != EAGAIN)) {
                // error
                _ftp_reset();
                ESP_LOGW(FTP_TAG, "Error sending list data.");
                break;
            }
        }
        timeout -= portTICK_PERIOD_MS;
    }
}

static void ftp_send_file_data(uint32_t datasize) {
    ftp_result_t result;
    uint32_t timeout = 200;

    ESP_LOGI(FTP_TAG, "Send file data: (%"PRIu32")", datasize);
    vTaskDelay(1);

    while (1) {
        result = send(ftp_data.d_sd, ftp_data.dBuffer, datasize, 0);
        if (result == datasize) {
            vTaskDelay(1);
            ESP_LOGI(FTP_TAG, "Send OK");
            break;
        } else {
            vTaskDelay(1);
            if ((timeout <= 0) || (errno != EAGAIN)) {
                // error
                _ftp_reset();
                ESP_LOGW(FTP_TAG, "Error sending file data.");
                break;
            }
        }
        timeout -= portTICK_PERIOD_MS;
    }
}

static ftp_result_t ftp_recv_non_blocking(int32_t sd, void *buff, int32_t Maxlen, int32_t *rxLen) {
    if (sd < 0)
        return E_FTP_RESULT_FAILED;

    *rxLen = recv(sd, buff, Maxlen, 0);
    if (*rxLen > 0)
        return E_FTP_RESULT_OK;
    else if (errno != EAGAIN)
        return E_FTP_RESULT_FAILED;

    return E_FTP_RESULT_CONTINUE;
}

static void ftp_open_child(char *pwd, char *dir) {
    ESP_LOGI(FTP_TAG, "open_child: %s + %s", pwd, dir);
    if (strlen(dir) > 0) {
        if (dir[0] == '/') {
            // ** absolute path
            strcpy(pwd, dir);
        } else {
            // ** relative path
            // add trailing '/' if needed
            if ((strlen(pwd) > 1) && (pwd[strlen(pwd) - 1] != '/') && (dir[0] != '/'))
                strcat(pwd, "/");
            // append directory/file name
            strcat(pwd, dir);
        }
    }
    ESP_LOGI(FTP_TAG, "open_child, New pwd: %s", pwd);
}

static void ftp_close_child(char *pwd) {
    ESP_LOGI(FTP_TAG, "close_child: %s", pwd);
    uint len = strlen(pwd);
    if (pwd[len - 1] == '/') {
        pwd[len - 1] = '\0';
        len--;
        if ((len == 0) || (strcmp(pwd, FTP_MOUNT_POINT) == 0) || (strcmp(pwd, FTP_MOUNT_POINT) == 0)) {
            strcpy(pwd, "/");
        }
    } else {
        while (len) {
            if (pwd[len - 1] == '/') {
                pwd[len - 1] = '\0';
                len--;
                break;
            }
            len--;
        }

        if (len == 0) {
            strcpy(pwd, "/");
        } else if ((strcmp(pwd, FTP_MOUNT_POINT) == 0) || (strcmp(pwd, FTP_MOUNT_POINT) == 0)) {
            strcat(pwd, "/");
        }
    }
    ESP_LOGI(FTP_TAG, "close_child, New pwd: %s", pwd);
}

static void remove_fname_from_path(char *pwd, char *fname) {
    ESP_LOGI(FTP_TAG, "remove_fname_from_path: %s - %s", pwd, fname);
    if (strlen(fname) == 0)
        return;
    char *xpwd = strstr(pwd, fname);
    if (xpwd == NULL)
        return;

    xpwd[0] = '\0';

    ESP_LOGI(FTP_TAG, "remove_fname_from_path: New pwd: %s", pwd);
}

