hiperiondev/esp32-microvium/components/esp32-ftp-server/esp32_ftp_server.c
static void ftp_pop_param(char **str, char *param, bool stop_on_space, bool stop_on_newline) {
    char lastc = '\0';
    while (**str != '\0') {
        if (stop_on_space && (**str == ' '))
            break;
        if ((**str == '\r') || (**str == '\n')) {
            if (!stop_on_newline) {
                (*str)++;
                continue;
            } else
                break;
        }
        if ((**str == '/') && (lastc == '/')) {
            (*str)++;
            continue;
        }
        lastc = **str;
        *param++ = **str;
        (*str)++;
    }
    *param = '\0';
}

static ftp_cmd_index_t ftp_pop_command(char **str) {
    char _cmd[FTPSERVER_CMD_SIZE_MAX];
    ftp_pop_param(str, _cmd, true, true);
    stoupper(_cmd);
    for (ftp_cmd_index_t i = 0; i < E_FTP_NUM_FTP_CMDS; i++) {
        if (!strcmp(_cmd, ftp_cmd_table[i].cmd)) {
            // move one step further to skip the space
            (*str)++;
            return i;
        }
    }
    return E_FTP_CMD_NOT_SUPPORTED;
}

static void ftp_get_param_and_open_child(char **bufptr) {
    ftp_pop_param(bufptr, ftp_scratch_buffer, false, false);
    ftp_open_child(ftp_path, ftp_scratch_buffer);
    ftp_data.closechild = true;
}

static void ftp_process_cmd(void) {
    int32_t len;
    char *bufptr = (char*) ftp_cmd_buffer;
    ftp_result_t result;
    struct stat buf;
    int res;

    memset(bufptr, 0, FTPSERVER_MAX_PARAM_SIZE + FTPSERVER_CMD_SIZE_MAX);
    ftp_data.closechild = false;

    // use the reply buffer to receive new commands
    result = ftp_recv_non_blocking(ftp_data.c_sd, ftp_cmd_buffer, FTPSERVER_MAX_PARAM_SIZE + FTPSERVER_CMD_SIZE_MAX, &len);
    if (result == E_FTP_RESULT_OK) {
        ftp_cmd_buffer[len] = '\0';
        // bufptr is moved as commands are being popped
        ftp_cmd_index_t cmd = ftp_pop_command(&bufptr);
        if (!ftp_data.loggin.passvalid
                && ((cmd != E_FTP_CMD_USER) && (cmd != E_FTP_CMD_PASS) && (cmd != E_FTP_CMD_QUIT) && (cmd != E_FTP_CMD_FEAT) && (cmd != E_FTP_CMD_AUTH))) {
            ftp_send_reply(332, NULL);
            return;
        }
        if ((cmd >= 0) && (cmd < E_FTP_NUM_FTP_CMDS)) {
            ESP_LOGI(FTP_TAG, "CMD: %s", ftp_cmd_table[cmd].cmd);
        } else {
            ESP_LOGI(FTP_TAG, "CMD: %d", cmd);
        }
        char fullname[128];
        char fullname2[128];
        strcpy(fullname, FTP_MOUNT_POINT);
        strcpy(fullname2, FTP_MOUNT_POINT);

        switch (cmd) {
            case E_FTP_CMD_FEAT:
                ftp_send_reply(502, "no-features");
                break;
            case E_FTP_CMD_AUTH:
                ftp_send_reply(504, "not-supported");
                break;
            case E_FTP_CMD_SYST:
                ftp_send_reply(215, "UNIX Type: L8");
                break;
            case E_FTP_CMD_CDUP:
                ftp_close_child(ftp_path);
                ftp_send_reply(250, NULL);
                break;
            case E_FTP_CMD_CWD:
                ftp_pop_param(&bufptr, ftp_scratch_buffer, false, false);

                if (strlen(ftp_scratch_buffer) > 0) {
                    if ((ftp_scratch_buffer[0] == '.') && (ftp_scratch_buffer[1] == '\0')) {
                        ftp_data.dp = NULL;
                        ftp_send_reply(250, NULL);
                        break;
                    }
                    if ((ftp_scratch_buffer[0] == '.') && (ftp_scratch_buffer[1] == '.') && (ftp_scratch_buffer[2] == '\0')) {
                        ftp_close_child(ftp_path);
                        ftp_send_reply(250, NULL);
                        break;
                    } else
                        ftp_open_child(ftp_path, ftp_scratch_buffer);
                }

                if ((ftp_path[0] == '/') && (ftp_path[1] == '\0')) {
                    ftp_data.dp = NULL;
                    ftp_send_reply(250, NULL);
                } else {
                    strcat(fullname, ftp_path);
                    ESP_LOGI(FTP_TAG, "E_FTP_CMD_CWD fullname=[%s]", fullname);
                    ftp_data.dp = opendir(fullname);
                    if (ftp_data.dp != NULL) {
                        closedir(ftp_data.dp);
                        ftp_data.dp = NULL;
                        ftp_send_reply(250, NULL);
                    } else {
                        ftp_close_child(ftp_path);
                        ftp_send_reply(550, NULL);
                    }
                }
                break;
            case E_FTP_CMD_PWD:
            case E_FTP_CMD_XPWD: {
                char lpath[128];
                strcpy(lpath, ftp_path);

                ftp_send_reply(257, lpath);
            }
                break;
            case E_FTP_CMD_SIZE: {
                ftp_get_param_and_open_child(&bufptr);
                strcat(fullname, ftp_path);
                ESP_LOGI(FTP_TAG, "E_FTP_CMD_SIZE fullname=[%s]", fullname);
                int res = stat(fullname, &buf);
                if (res == 0) {
                    // send the file size
                    snprintf((char*) ftp_data.dBuffer, ftp_buff_size, "%"PRIu32, (uint32_t) buf.st_size);
                    ftp_send_reply(213, (char*) ftp_data.dBuffer);
                } else {
                    ftp_send_reply(550, NULL);
                }
            }
                break;
            case E_FTP_CMD_MDTM:
                ftp_get_param_and_open_child(&bufptr);
                strcat(fullname, ftp_path);
                ESP_LOGI(FTP_TAG, "E_FTP_CMD_MDTM fullname=[%s]", fullname);
                res = stat(fullname, &buf);
                if (res == 0) {
                    // send the file modification time
                    time_t time = buf.st_mtime;
                    struct tm *ptm = localtime(&time);
                    strftime((char*) ftp_data.dBuffer, ftp_buff_size, "%Y%m%d%H%M%S", ptm);
                    ESP_LOGI(FTP_TAG, "E_FTP_CMD_MDTM ftp_data.dBuffer=[%s]", ftp_data.dBuffer);
                    ftp_send_reply(213, (char*) ftp_data.dBuffer);
                } else {
                    ftp_send_reply(550, NULL);
                }
                break;
            case E_FTP_CMD_TYPE:
                ftp_send_reply(200, NULL);
                break;
            case E_FTP_CMD_USER:
                ftp_pop_param(&bufptr, ftp_scratch_buffer, true, true);
                if (!memcmp(ftp_scratch_buffer, ftp_user, MAX(strlen(ftp_scratch_buffer), strlen(ftp_user)))) {
                    ftp_data.loggin.uservalid = true && (strlen(ftp_user) == strlen(ftp_scratch_buffer));
                }
                ftp_send_reply(331, NULL);
                break;
            case E_FTP_CMD_PASS:
                ftp_pop_param(&bufptr, ftp_scratch_buffer, true, true);
                if (!memcmp(ftp_scratch_buffer, ftp_pass, MAX(strlen(ftp_scratch_buffer), strlen(ftp_pass))) && ftp_data.loggin.uservalid) {
                    ftp_data.loggin.passvalid = true && (strlen(ftp_pass) == strlen(ftp_scratch_buffer));
                    if (ftp_data.loggin.passvalid) {
                        ftp_send_reply(230, NULL);
                        break;
                    }
                }
                ftp_send_reply(530, NULL);
                break;
            case E_FTP_CMD_PASV: {
                // some servers (e.g. google chrome) send PASV several times very quickly
                closesocket(ftp_data.d_sd);
                ftp_data.d_sd = -1;
                ftp_data.substate = E_FTP_STE_SUB_DISCONNECTED;
                bool socketcreated = true;
                if (ftp_data.ld_sd < 0) {
                    socketcreated = ftp_create_listening_socket(&ftp_data.ld_sd, FTPSERVER_PASIVE_DATA_PORT, FTPSERVER_DATA_CLIENTS_MAX - 1);
                }
                if (socketcreated) {
                    uint8_t *pip = (uint8_t*) &ftp_data.ip_addr;
                    ftp_data.dtimeout = 0;
                    snprintf((char*) ftp_data.dBuffer, ftp_buff_size, "(%u,%u,%u,%u,%u,%u)", pip[0], pip[1], pip[2], pip[3], (FTPSERVER_PASIVE_DATA_PORT >> 8),
                            (FTPSERVER_PASIVE_DATA_PORT & 0xFF));
                    ftp_data.substate = E_FTP_STE_SUB_LISTEN_FOR_DATA;
                    ESP_LOGI(FTP_TAG, "Data socket created");
                    ftp_send_reply(227, (char*) ftp_data.dBuffer);
                } else {
                    ESP_LOGW(FTP_TAG, "Error creating data socket");
                    ftp_send_reply(425, NULL);
                }
            }
                break;
            case E_FTP_CMD_LIST:
            case E_FTP_CMD_NLST:
                ftp_get_param_and_open_child(&bufptr);
                if (cmd == E_FTP_CMD_LIST)
                    ftp_nlist = 0;
                else
                    ftp_nlist = 1;
                if (ftp_open_dir_for_listing(ftp_path) == E_FTP_RESULT_CONTINUE) {
                    ftp_data.state = E_FTP_STE_CONTINUE_LISTING;
                    ftp_send_reply(150, NULL);
                } else
                    ftp_send_reply(550, NULL);
                break;
            case E_FTP_CMD_RETR:
                ftp_data.total = 0;
                ftp_data.time = 0;
                ftp_get_param_and_open_child(&bufptr);
                if ((strlen(ftp_path) > 0) && (ftp_path[strlen(ftp_path) - 1] != '/')) {
                    if (ftp_open_file(ftp_path, "rb")) {
                        ftp_data.state = E_FTP_STE_CONTINUE_FILE_TX;
                        vTaskDelay(20 / portTICK_PERIOD_MS);
                        ftp_send_reply(150, NULL);
                    } else {
                        ftp_data.state = E_FTP_STE_END_TRANSFER;
                        ftp_send_reply(550, NULL);
                    }
                } else {
                    ftp_data.state = E_FTP_STE_END_TRANSFER;
                    ftp_send_reply(550, NULL);
                }
                break;
            case E_FTP_CMD_APPE:
                ftp_data.total = 0;
                ftp_data.time = 0;
                ftp_get_param_and_open_child(&bufptr);
                if ((strlen(ftp_path) > 0) && (ftp_path[strlen(ftp_path) - 1] != '/')) {
                    if (ftp_open_file(ftp_path, "ab")) {
                        ftp_data.state = E_FTP_STE_CONTINUE_FILE_RX;
                        vTaskDelay(20 / portTICK_PERIOD_MS);
                        ftp_send_reply(150, NULL);
                    } else {
                        ftp_data.state = E_FTP_STE_END_TRANSFER;
                        ftp_send_reply(550, NULL);
                    }
                } else {
                    ftp_data.state = E_FTP_STE_END_TRANSFER;
                    ftp_send_reply(550, NULL);
                }
                break;
            case E_FTP_CMD_STOR:
                ftp_data.total = 0;
                ftp_data.time = 0;
                ftp_get_param_and_open_child(&bufptr);
                if ((strlen(ftp_path) > 0) && (ftp_path[strlen(ftp_path) - 1] != '/')) {
                    ESP_LOGI(FTP_TAG, "E_FTP_CMD_STOR ftp_path=[%s]", ftp_path);
                    if (ftp_open_file(ftp_path, "wb")) {
                        ftp_data.state = E_FTP_STE_CONTINUE_FILE_RX;
                        vTaskDelay(20 / portTICK_PERIOD_MS);
                        ftp_send_reply(150, NULL);
                    } else {
                        ftp_data.state = E_FTP_STE_END_TRANSFER;
                        ftp_send_reply(550, NULL);
                    }
                } else {
                    ftp_data.state = E_FTP_STE_END_TRANSFER;
                    ftp_send_reply(550, NULL);
                }
                break;
            case E_FTP_CMD_DELE:
                ftp_get_param_and_open_child(&bufptr);
                if ((strlen(ftp_path) > 0) && (ftp_path[strlen(ftp_path) - 1] != '/')) {
                    ESP_LOGI(FTP_TAG, "E_FTP_CMD_DELE ftp_path=[%s]", ftp_path);

                    strcat(fullname, ftp_path);
                    ESP_LOGI(FTP_TAG, "E_FTP_CMD_DELE fullname=[%s]", fullname);

