hiperiondev/esp32-microvium/components/esp32-ftp-server/esp32_ftp_server.c
                    //if (unlink(ftp_path) == 0) {
                    if (unlink(fullname) == 0) {
                        vTaskDelay(20 / portTICK_PERIOD_MS);
                        ftp_send_reply(250, NULL);
                    } else
                        ftp_send_reply(550, NULL);
                } else
                    ftp_send_reply(250, NULL);
                break;
            case E_FTP_CMD_RMD:
                ftp_get_param_and_open_child(&bufptr);
                if ((strlen(ftp_path) > 0) && (ftp_path[strlen(ftp_path) - 1] != '/')) {
                    ESP_LOGI(FTP_TAG, "E_FTP_CMD_RMD ftp_path=[%s]", ftp_path);

                    strcat(fullname, ftp_path);
                    ESP_LOGI(FTP_TAG, "E_FTP_CMD_MKD fullname=[%s]", fullname);

                    if (rmdir(fullname) == 0) {
                        vTaskDelay(20 / portTICK_PERIOD_MS);
                        ftp_send_reply(250, NULL);
                    } else
                        ftp_send_reply(550, NULL);
                } else
                    ftp_send_reply(250, NULL);
                break;
            case E_FTP_CMD_MKD:
                ftp_get_param_and_open_child(&bufptr);
                if ((strlen(ftp_path) > 0) && (ftp_path[strlen(ftp_path) - 1] != '/')) {
                    ESP_LOGI(FTP_TAG, "E_FTP_CMD_MKD ftp_path=[%s]", ftp_path);

                    strcat(fullname, ftp_path);
                    ESP_LOGI(FTP_TAG, "E_FTP_CMD_MKD fullname=[%s]", fullname);

                    if (mkdir(fullname, 0755) == 0) {
                        vTaskDelay(20 / portTICK_PERIOD_MS);
                        ftp_send_reply(250, NULL);
                    } else
                        ftp_send_reply(550, NULL);
                } else
                    ftp_send_reply(250, NULL);
                break;
            case E_FTP_CMD_RNFR:
                ftp_get_param_and_open_child(&bufptr);
                ESP_LOGI(FTP_TAG, "E_FTP_CMD_RNFR ftp_path=[%s]", ftp_path);

                strcat(fullname, ftp_path);
                ESP_LOGI(FTP_TAG, "E_FTP_CMD_MKD fullname=[%s]", fullname);

                res = stat(fullname, &buf);
                if (res == 0) {
                    ftp_send_reply(350, NULL);
                    // save the path of the file to rename
                    strcpy((char*) ftp_data.dBuffer, ftp_path);
                } else {
                    ftp_send_reply(550, NULL);
                }
                break;
            case E_FTP_CMD_RNTO:
                ftp_get_param_and_open_child(&bufptr);
                // the path of the file to rename was saved in the data buffer
                ESP_LOGI(FTP_TAG, "E_FTP_CMD_RNTO ftp_path=[%s], ftp_data.dBuffer=[%s]", ftp_path, (char* ) ftp_data.dBuffer);
                strcat(fullname, (char*) ftp_data.dBuffer);
                ESP_LOGI(FTP_TAG, "E_FTP_CMD_RNTO fullname=[%s]", fullname);
                strcat(fullname2, ftp_path);
                ESP_LOGI(FTP_TAG, "E_FTP_CMD_RNTO fullname2=[%s]", fullname2);

                //if (rename((char *)ftp_data.dBuffer, ftp_path) == 0) {
                if (rename(fullname, fullname2) == 0) {
                    ftp_send_reply(250, NULL);
                } else {
                    ftp_send_reply(550, NULL);
                }
                break;
            case E_FTP_CMD_NOOP:
                ftp_send_reply(200, NULL);
                break;
            case E_FTP_CMD_QUIT:
                ftp_send_reply(221, NULL);
                break;
            default:
                // command not implemented
                ftp_send_reply(502, NULL);
                break;
        }

        if (ftp_data.closechild) {
            remove_fname_from_path(ftp_path, ftp_scratch_buffer);
        }
    } else if (result == E_FTP_RESULT_CONTINUE) {
        if (ftp_data.ctimeout > ftp_timeout) {
            ftp_send_reply(221, NULL);
            ESP_LOGW(FTP_TAG, "Connection timeout");
        }
    } else {
        ftp_close_cmd_data();
    }
}

static void ftp_wait_for_enabled(void) {
    // Check if the telnet service has been enabled
    if (ftp_data.enabled) {
        ftp_data.state = E_FTP_STE_START;
    }
}

void ftp_deinit(void) {
    if (ftp_path)
        free(ftp_path);
    if (ftp_cmd_buffer)
        free(ftp_cmd_buffer);
    if (ftp_data.dBuffer)
        free(ftp_data.dBuffer);
    if (ftp_scratch_buffer)
        free(ftp_scratch_buffer);
    ftp_path = NULL;
    ftp_cmd_buffer = NULL;
    ftp_data.dBuffer = NULL;
    ftp_scratch_buffer = NULL;
}

bool ftp_init(void) {
    ftp_stop = 0;
    // Allocate memory for the data buffer, and the file system structures (from the RTOS heap)
    ftp_deinit();

    memset(&ftp_data, 0, sizeof(ftp_data_t));
    ftp_data.dBuffer = malloc(ftp_buff_size + 1);
    if (ftp_data.dBuffer == NULL)
        return false;
    ftp_path = malloc(FTPSERVER_MAX_PARAM_SIZE);
    if (ftp_path == NULL) {
        free(ftp_data.dBuffer);
        return false;
    }
    ftp_scratch_buffer = malloc(FTPSERVER_MAX_PARAM_SIZE);
    if (ftp_scratch_buffer == NULL) {
        free(ftp_path);
        free(ftp_data.dBuffer);
        return false;
    }
    ftp_cmd_buffer = malloc(FTPSERVER_MAX_PARAM_SIZE + FTPSERVER_CMD_SIZE_MAX);
    if (ftp_cmd_buffer == NULL) {
        free(ftp_scratch_buffer);
        free(ftp_path);
        free(ftp_data.dBuffer);
        return false;
    }

    ftp_data.c_sd = -1;
    ftp_data.d_sd = -1;
    ftp_data.lc_sd = -1;
    ftp_data.ld_sd = -1;
    ftp_data.e_open = E_FTP_NOTHING_OPEN;
    ftp_data.state = E_FTP_STE_DISABLED;
    ftp_data.substate = E_FTP_STE_SUB_DISCONNECTED;

    return true;
}

int ftp_run(uint32_t elapsed) {
    if (ftp_stop)
        return -2;

    ftp_data.dtimeout += elapsed;
    ftp_data.ctimeout += elapsed;
    ftp_data.time += elapsed;

    switch (ftp_data.state) {
        case E_FTP_STE_DISABLED:
            ftp_wait_for_enabled();
            break;
        case E_FTP_STE_START:
            if (ftp_create_listening_socket(&ftp_data.lc_sd, FTPSERVER_CMD_PORT, FTPSERVER_CMD_CLIENTS_MAX - 1)) {
                ftp_data.state = E_FTP_STE_READY;
            }
            break;
        case E_FTP_STE_READY:
            if (ftp_data.c_sd < 0 && ftp_data.substate == E_FTP_STE_SUB_DISCONNECTED) {
                if (E_FTP_RESULT_OK == ftp_wait_for_connection(ftp_data.lc_sd, &ftp_data.c_sd, &ftp_data.ip_addr)) {
                    ftp_data.txRetries = 0;
                    ftp_data.logginRetries = 0;
                    ftp_data.ctimeout = 0;
                    ftp_data.loggin.uservalid = false;
                    ftp_data.loggin.passvalid = false;
                    strcpy(ftp_path, "/");
                    ESP_LOGI(FTP_TAG, "Connected.");
                    ftp_send_reply(220, "ESP FTP Server");
                    break;
                }
            }
            if (ftp_data.c_sd > 0 && ftp_data.substate != E_FTP_STE_SUB_LISTEN_FOR_DATA) {
                ftp_process_cmd();
                if (ftp_data.state != E_FTP_STE_READY) {
                    break;
                }
            }
            break;
        case E_FTP_STE_END_TRANSFER:
            if (ftp_data.d_sd >= 0) {
                closesocket(ftp_data.d_sd);
                ftp_data.d_sd = -1;
            }
            break;
        case E_FTP_STE_CONTINUE_LISTING:
            // go on with listing
        {
            uint32_t listsize = 0;
            ftp_result_t list_res = ftp_list_dir((char*) ftp_data.dBuffer, ftp_buff_size, &listsize);
            if (listsize > 0)
                ftp_send_list(listsize);
            if (list_res == E_FTP_RESULT_OK) {
                ftp_send_reply(226, NULL);
                ftp_data.state = E_FTP_STE_END_TRANSFER;
            }
            ftp_data.ctimeout = 0;
        }
            break;
        case E_FTP_STE_CONTINUE_FILE_TX:
            // read and send the next block from the file
        {
            uint32_t readsize;
            ftp_result_t result;
            ftp_data.ctimeout = 0;
            result = ftp_read_file((char*) ftp_data.dBuffer, ftp_buff_size, &readsize);
            if (result == E_FTP_RESULT_FAILED) {
                ftp_send_reply(451, NULL);
                ftp_data.state = E_FTP_STE_END_TRANSFER;
            } else {
                if (readsize > 0) {
                    ftp_send_file_data(readsize);
                    ftp_data.total += readsize;
                    ESP_LOGI(FTP_TAG, "Sent %"PRIu32", total: %"PRIu32, readsize, ftp_data.total);
                }
                if (result == E_FTP_RESULT_OK) {
                    ftp_send_reply(226, NULL);
                    ftp_data.state = E_FTP_STE_END_TRANSFER;
                    ESP_LOGI(FTP_TAG, "File sent (%"PRIu32" bytes in %"PRIu32" msec).", ftp_data.total, ftp_data.time);
                }
            }
        }
            break;
        case E_FTP_STE_CONTINUE_FILE_RX: {
            int32_t len;
            ftp_result_t result = E_FTP_RESULT_OK;

