hiperiondev/esp32-microvium/components/esp32-ftp-server/esp32_ftp_server.c
            result = ftp_recv_non_blocking(ftp_data.d_sd, ftp_data.dBuffer, ftp_buff_size, &len);
            if (result == E_FTP_RESULT_OK) {
                // block of data received
                ftp_data.dtimeout = 0;
                ftp_data.ctimeout = 0;
                // save received data to file
                if (E_FTP_RESULT_OK != ftp_write_file((char*) ftp_data.dBuffer, len)) {
                    ftp_send_reply(451, NULL);
                    ftp_data.state = E_FTP_STE_END_TRANSFER;
                    ESP_LOGW(FTP_TAG, "Error writing to file");
                } else {
                    ftp_data.total += len;
                    ESP_LOGI(FTP_TAG, "Received %"PRIu32", total: %"PRIu32, len, ftp_data.total);
                }
            } else if (result == E_FTP_RESULT_CONTINUE) {
                // nothing received
                if (ftp_data.dtimeout > FTPSERVER_DATA_TIMEOUT_MS) {
                    ftp_close_files_dir();
                    ftp_send_reply(426, NULL);
                    ftp_data.state = E_FTP_STE_END_TRANSFER;
                    ESP_LOGW(FTP_TAG, "Receiving to file timeout");
                }
            } else {
                // File received (E_FTP_RESULT_FAILED)
                ftp_close_files_dir();
                ftp_send_reply(226, NULL);
                ftp_data.state = E_FTP_STE_END_TRANSFER;
                ESP_LOGI(FTP_TAG, "File received (%"PRIu32" bytes in %"PRIu32" msec).", ftp_data.total, ftp_data.time);
                break;
            }
        }
            break;
        default:
            break;
    }

    switch (ftp_data.substate) {
        case E_FTP_STE_SUB_DISCONNECTED:
            break;
        case E_FTP_STE_SUB_LISTEN_FOR_DATA:
            if (E_FTP_RESULT_OK == ftp_wait_for_connection(ftp_data.ld_sd, &ftp_data.d_sd, NULL)) {
                ftp_data.dtimeout = 0;
                ftp_data.substate = E_FTP_STE_SUB_DATA_CONNECTED;
                ESP_LOGI(FTP_TAG, "Data socket connected");
            } else if (ftp_data.dtimeout > FTPSERVER_DATA_TIMEOUT_MS) {
                ESP_LOGW(FTP_TAG, "Waiting for data connection timeout (%"PRIi32")", ftp_data.dtimeout);
                ftp_data.dtimeout = 0;
                // close the listening socket
                closesocket(ftp_data.ld_sd);
                ftp_data.ld_sd = -1;
                ftp_data.substate = E_FTP_STE_SUB_DISCONNECTED;
            }
            break;
        case E_FTP_STE_SUB_DATA_CONNECTED:
            if (ftp_data.state == E_FTP_STE_READY && (ftp_data.dtimeout > FTPSERVER_DATA_TIMEOUT_MS)) {
                // close the listening and the data socket
                closesocket(ftp_data.ld_sd);
                closesocket(ftp_data.d_sd);
                ftp_data.ld_sd = -1;
                ftp_data.d_sd = -1;
                ftp_close_filesystem_on_error();
                ftp_data.substate = E_FTP_STE_SUB_DISCONNECTED;
                ESP_LOGW(FTP_TAG, "Data connection timeout");
            }
            break;
        default:
            break;
    }

    // check the state of the data sockets
    if (ftp_data.d_sd < 0 && (ftp_data.state > E_FTP_STE_READY)) {
        ftp_data.substate = E_FTP_STE_SUB_DISCONNECTED;
        ftp_data.state = E_FTP_STE_READY;
        ESP_LOGI(FTP_TAG, "Data socket disconnected");
    }

    return 0;
}

bool ftp_enable(void) {
    bool res = false;
    if (ftp_data.state == E_FTP_STE_DISABLED) {
        ftp_data.enabled = true;
        res = true;
    }
    return res;
}

bool ftp_isenabled(void) {
    bool res = (ftp_data.enabled == true);
    return res;
}

bool ftp_disable(void) {
    bool res = false;
    if (ftp_data.state == E_FTP_STE_READY) {
        _ftp_reset();
        ftp_data.enabled = false;
        ftp_data.state = E_FTP_STE_DISABLED;
        res = true;
    }
    return res;
}

bool ftp_reset(void) {
    _ftp_reset();
    return true;
}

int ftp_getstate() {
    int fstate = ftp_data.state | (ftp_data.substate << 8);
    if ((ftp_data.state == E_FTP_STE_READY) && (ftp_data.c_sd > 0))
        fstate = E_FTP_STE_CONNECTED;
    return fstate;
}

bool ftp_terminate(void) {
    bool res = false;
    if (ftp_data.state == E_FTP_STE_READY) {
        ftp_stop = 1;
        _ftp_reset();
        res = true;
    }
    return res;
}

bool ftp_stop_requested(void) {
    bool res = (ftp_stop == 1);
    return res;
}

void ftp_task(void *pvParameters) {
    ESP_LOGI(FTP_TAG, "ftp_task start");
    esp_log_level_set(FTP_TAG, ESP_LOG_WARN);
    strcpy(ftp_user, CONFIG_FTP_USER);
    strcpy(ftp_pass, CONFIG_FTP_PASSWORD);
    ESP_LOGI(FTP_TAG, "ftp_user:[%s] ftp_pass:[%s]", ftp_user, ftp_pass);

    uint64_t elapsed, time_ms = mp_hal_ticks_ms();
    // Initialize ftp, create rx buffer and mutex
    if (!ftp_init()) {
        ESP_LOGE(FTP_TAG, "Init Error");
        vTaskDelete(NULL);
    }

    // We have network connection, enable ftp
    ftp_enable();

    time_ms = mp_hal_ticks_ms();
    while (1) {
    // Calculate time between two ftp_run() calls
        elapsed = mp_hal_ticks_ms() - time_ms;
        time_ms = mp_hal_ticks_ms();

        int res = ftp_run(elapsed);
        if (res < 0) {
            if (res == -1) {
                ESP_LOGE(FTP_TAG, "\nRun Error");
            }
            // -2 is returned if Ftp stop was requested by user
            break;
        }

        vTaskDelay(1);

    }

    ESP_LOGW(FTP_TAG, "\nTask terminated!");
    vTaskDelete(NULL);
}
